---
kind: enumMember
id: F:Autodesk.Revit.DB.Visual.AssetPropertyType.Unknown
enum: Autodesk.Revit.DB.Visual.AssetPropertyType
source: html/3463b8a3-5c87-63c0-03d1-a20e442f6f28.htm
---
# Autodesk.Revit.DB.Visual.AssetPropertyType.Unknown

An unknown or unspecified property type.